open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_yuv_h264.c
/* SPDX-License-Identifier: Apache-2.0 */
/****************************************************************************
 * tests/modules/ap/test_bk7258_yuv_h264.c
 *
 * Host unit tests for chips/bk7258/ap/bk7258_yuv_h264.c, compiled
 * unmodified against the mock SDK surface in mocks/driver/.
 *
 * The mock SDK (framework/mock_sdk_yuv_h264.{c,h}) logs every call in
 * order, records the captured dma/yuv configuration snapshots, exposes
 * programmable bk_err_t results per function, and keeps the ISR callbacks
 * the driver registered so tests can fire LINE/FINAL/error events through
 * the nxsem_tickwait hook.  All event flows are therefore driven
 * single-threaded and deterministically.
 ****************************************************************************/

#include <errno.h>
#include <stdarg.h>
#include <stddef.h>
#include <stdint.h>
#include <setjmp.h>
#include <stdio.h>
#include <string.h>

#include <cmocka.h>

#include "bk7258_yuv_h264.h"

#include "mock_sdk_yuv_h264.h"

/* Test geometry: 64x64 YUYV -> frame 8192 B, 16-line block 2048 B,
 * 4 blocks, cache 2 x block = 4096 B.  Output capacity is 2 DMA chunks
 * (20 KiB), which is the minimum multiple-of-chunk size above one chunk. */

#define TEST_WIDTH     64u
#define TEST_HEIGHT    64u
#define FRAME_BYTES    8192u
#define BLOCK_BYTES    2048u
#define CACHE_BYTES    4096u
#define CAPACITY       20480u
#define CHUNK          10240u
#define H264_IRQ_BIT   (1u << 14)
#define ROOT_H264      8u
#define DMA_USER       40u

static struct bk7258_yuv_h264_s *g_priv;
static uint8_t g_cache[CACHE_BYTES] __attribute__((aligned(64)));
static uint8_t g_input[FRAME_BYTES] __attribute__((aligned(64)));
static uint8_t g_out[CAPACITY] __attribute__((aligned(64)));
static uint8_t g_out2[CAPACITY] __attribute__((aligned(64)));

/* Tickwait-hook behavior selection, assigned by each test. */
static void (*g_hook)(void);
static unsigned int g_hook_guard;

static void hook_noop(void)
{
}

static void hook_fire_final(void)
{
  mock_yuv_fire_h264_final();
}

static void hook_fire_happy(void)
{
  if (g_hook_guard++ < 3u)
    {
      mock_yuv_fire_h264_line();
    }
  else
    {
      mock_yuv_fire_h264_final();
    }
}

static void hook_fire_finish_and_final(void)
{
  mock_yuv_fire_dma_finish();
  mock_yuv_fire_h264_final();
}

static void hook_fire_finishes_and_final(void)
{
  mock_yuv_fire_dma_finish();
  mock_yuv_fire_dma_finish();
  mock_yuv_fire_dma_finish();
  mock_yuv_fire_h264_final();
}

static void hook_fire_full_then_silence(void)
{
  if (g_hook_guard++ < 2u)
    {
      mock_yuv_fire_dma_finish();
    }
}

static void hook_error_event(void)
{
  mock_yuv_fire_yuv_error();
}

static void hook_mid_rencode_fail(void)
{
  mock_yuv_set_ret(MOCK_YUV_FN_YUV_RENCODE_START, BK_ERR_BUSY);
  mock_yuv_fire_h264_line();
}

static struct bk7258_yuv_h264_config_s default_config(void)
{
  struct bk7258_yuv_h264_config_s cfg;

  cfg.width = TEST_WIDTH;
  cfg.height = TEST_HEIGHT;
  cfg.format = BK7258_YUV_H264_YUYV;
  cfg.line_cache = g_cache;
  cfg.line_cache_size = CACHE_BYTES;
  cfg.timeout_ms = 100;
  return cfg;
}

static int group_setup(void **state)
{
  (void)state;
  mock_yuv_sdk_reset();
  g_priv = NULL;
  g_hook = hook_noop;
  g_hook_guard = 0;
  memset(g_input, 0x5a, sizeof(g_input));
  memset(g_cache, 0, sizeof(g_cache));
  memset(g_out, 0, sizeof(g_out));
  return 0;
}

static int setup_ok(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();

  (void)state;
  group_setup(state);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), 0);
  assert_non_null(g_priv);
  return 0;
}

static int teardown_reset(void **state)
{
  (void)state;
  mock_yuv_sdk_reset();
  g_priv = NULL;
  g_hook = hook_noop;
  g_hook_guard = 0;
  return 0;
}

static int teardown_ok(void **state)
{
  (void)state;
  if (g_priv != NULL)
    {
      bk7258_yuv_h264_uninitialize(g_priv);
      g_priv = NULL;
    }

  mock_yuv_sdk_reset();
  g_hook = hook_noop;
  g_hook_guard = 0;
  return 0;
}

/* Prepare mock values for a successful frame and run encode().  The
 * tickwait hook fires the full line/final sequence. */
static int run_happy_encode(struct bk7258_yuv_h264_output_s *output)
{
  struct bk7258_yuv_h264_input_s input;

  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_tickwait_hook(hook_fire_happy);
  g_hook_guard = 0;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output->data = g_out;
  output->capacity = CAPACITY;
  output->length = 0;
  return bk7258_yuv_h264_encode(g_priv, &input, output);
}

/* ---------------------------------------------------------------------- */
/* initialize                                                             */
/* ---------------------------------------------------------------------- */

static void init_geometry_reject(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();
  struct bk7258_yuv_h264_s *out = NULL;
  uint16_t bad_width[4] = { 0, 1921, 72, 65 };
  uint16_t bad_height[4] = { 16, 1090, 40, 33 };
  int i;

  (void)state;
  for (i = 0; i < 4; i++)
    {
      cfg.width = bad_width[i];
      cfg.height = TEST_HEIGHT;
      assert_int_equal(bk7258_yuv_h264_initialize(&out, &cfg), -EINVAL);
      assert_null(out);
      cfg.width = TEST_WIDTH;
      cfg.height = bad_height[i];
      assert_int_equal(bk7258_yuv_h264_initialize(&out, &cfg), -EINVAL);
      assert_null(out);
    }

  cfg.width = TEST_WIDTH;
  cfg.height = TEST_HEIGHT;
  cfg.format = 4;
  assert_int_equal(bk7258_yuv_h264_initialize(&out, &cfg), -EINVAL);
  assert_int_equal(mock_yuv_call_count(), 0);
}

static void init_param_checks(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();
  struct bk7258_yuv_h264_s *h = NULL;

  (void)state;
  assert_int_equal(bk7258_yuv_h264_initialize(NULL, &cfg), -EINVAL);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, NULL), -EINVAL);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), 0);
  assert_non_null(g_priv);
  h = g_priv;
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -EBUSY);
  assert_null(g_priv);
  assert_int_equal(bk7258_yuv_h264_uninitialize(h), 0);
}

static void init_cache_reject(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();
  struct bk7258_yuv_h264_s *out = NULL;

  (void)state;
  cfg.line_cache = NULL;
  assert_int_equal(bk7258_yuv_h264_initialize(&out, &cfg), -EINVAL);
  cfg.line_cache = g_cache;
  cfg.line_cache_size = 0;
  assert_int_equal(bk7258_yuv_h264_initialize(&out, &cfg), -EINVAL);
  cfg.line_cache_size = CACHE_BYTES - 1;
  assert_int_equal(bk7258_yuv_h264_initialize(&out, &cfg), -EINVAL);
  cfg.line_cache_size = CACHE_BYTES;
  cfg.line_cache = g_cache + 1;
  assert_int_equal(bk7258_yuv_h264_initialize(&out, &cfg), -EINVAL);
}

static void init_stream_call_order(void **state)
{
  const struct mock_yuv_call_s *c;
  const yuv_buf_config_t *yc;

  (void)state;
  assert_int_equal(mock_yuv_call_count(), 15);
  c = mock_yuv_call(0);
  assert_int_equal(c->fn, MOCK_YUV_FN_MEDIA_ROOT_INIT);
  assert_int_equal(c->a0, ROOT_H264);
  c = mock_yuv_call(1);
  assert_int_equal(c->fn, MOCK_YUV_FN_DMA_ALLOC);
  assert_int_equal(c->a0, DMA_USER);
  c = mock_yuv_call(2);
  assert_int_equal(c->fn, MOCK_YUV_FN_DMA_REGISTER_ISR);
  assert_int_equal(c->a0, DMA_ID_3);
  c = mock_yuv_call(3);
  assert_int_equal(c->fn, MOCK_YUV_FN_YUV_INIT);
  c = mock_yuv_call(4);
  assert_int_equal(c->fn, MOCK_YUV_FN_YUV_NOSENSOR);
  c = mock_yuv_call(5);
  assert_int_equal(c->fn, MOCK_YUV_FN_H264_INIT);
  assert_int_equal(c->a0, TEST_WIDTH);
  assert_int_equal(c->a1, TEST_HEIGHT);
  c = mock_yuv_call(6);
  assert_int_equal(c->fn, MOCK_YUV_FN_YUV_SET_EM_BASE);
  assert_int_equal(c->a0, (uint32_t)(uintptr_t)g_cache);
  c = mock_yuv_call(7);
  assert_int_equal(c->fn, MOCK_YUV_FN_H264_GET_FIFO);
  c = mock_yuv_call(8);
  assert_int_equal(c->fn, MOCK_YUV_FN_SYS_GROUP2_DISABLE);
  assert_int_equal(c->a0, 2u);
  assert_int_equal(c->a1, H264_IRQ_BIT);
  c = mock_yuv_call(9);
  assert_int_equal(c->fn, MOCK_YUV_FN_SYS_GROUP2_ENABLE);
  assert_int_equal(c->a0, 1u);
  assert_int_equal(c->a1, H264_IRQ_BIT);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_REGISTER_ISR), 2);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_REGISTER_ISR), 1);
  c = mock_yuv_call(13);
  assert_int_equal(c->fn, MOCK_YUV_FN_YUV_START);
  assert_int_equal(c->a0, H264_MODE);
  c = mock_yuv_call(14);
  assert_int_equal(c->fn, MOCK_YUV_FN_H264_ENCODE_ENABLE);

