open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_yuv_h264.c
  yc = mock_yuv_yuv_config();
  assert_true(mock_yuv_yuv_config_valid());
  assert_int_equal(yc->work_mode, H264_MODE);
  assert_int_equal(yc->mclk_div, YUV_MCLK_DIV_4);
  assert_int_equal(yc->x_pixel, 8u);
  assert_int_equal(yc->y_pixel, 8u);
  assert_int_equal(yc->yuv_mode_cfg.yuv_format, YUV_FORMAT_YUYV);
  assert_int_equal(yc->yuv_mode_cfg.vsync, SYNC_HIGH_LEVEL);
  assert_int_equal(yc->yuv_mode_cfg.hsync, SYNC_HIGH_LEVEL);
  assert_null(yc->base_addr);
  assert_null(yc->emr_base_addr);
}

static void init_root_fail_rolls_back(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();

  (void)state;
  mock_yuv_set_root_ret(-EBUSY);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -EBUSY);
  assert_null(g_priv);
  assert_int_equal(mock_yuv_call_count(), 1);
  mock_yuv_set_root_ret(0);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), 0);
}

static void init_dma_alloc_fail(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();
  const struct mock_yuv_call_s *c;

  (void)state;
  mock_yuv_set_alloc(DMA_ID_MAX);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -EBUSY);
  assert_null(g_priv);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_REGISTER_ISR), 0);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_FREE), 0);
  mock_yuv_set_alloc(DMA_ID_3);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), 0);

  assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), 0);
  c = mock_yuv_call(mock_yuv_call_count() - 1);
  assert_int_equal(c->fn, MOCK_YUV_FN_DMA_FREE);
  assert_int_equal(c->a0, DMA_USER);
  assert_int_equal(c->a1, DMA_ID_3);
}

static void init_register_isr_fail(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();

  (void)state;
  mock_yuv_set_ret(MOCK_YUV_FN_DMA_REGISTER_ISR, BK_ERR_DMA_ID);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -EINVAL);
  assert_null(g_priv);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_FREE), 1);
  mock_yuv_set_ret(MOCK_YUV_FN_DMA_REGISTER_ISR, BK_OK);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), 0);
}

static void init_stream_fail_yuv_init(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();

  (void)state;
  mock_yuv_set_ret(MOCK_YUV_FN_YUV_INIT, BK_ERR_PARAM);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -EINVAL);
  assert_null(g_priv);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_DEINIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_NOSENSOR), 0);
  mock_yuv_set_ret(MOCK_YUV_FN_YUV_INIT, BK_OK);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), 0);
}

static void init_stream_fail_h264_init(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();

  (void)state;
  mock_yuv_set_ret(MOCK_YUV_FN_H264_INIT, BK_ERR_TIMEOUT);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -ETIMEDOUT);
  assert_null(g_priv);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_DEINIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_DEINIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_FREE), 1);
}

static void init_stream_fail_set_em_base(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();

  (void)state;
  mock_yuv_set_ret(MOCK_YUV_FN_YUV_SET_EM_BASE, BK_ERR_PARAM);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -EINVAL);
  assert_null(g_priv);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_DEINIT), 1);
}

static void init_stream_fail_route(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();

  (void)state;
  mock_yuv_set_sys_enable(1);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -EIO);
  assert_null(g_priv);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_SYS_GROUP2_DISABLE), 2);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_DEINIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_DEINIT), 1);
}

static void init_stream_fail_isr_register(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();

  (void)state;
  mock_yuv_set_ret(MOCK_YUV_FN_YUV_REGISTER_ISR,
                   BK_ERR_YUV_BUF_DRIVER_NOT_INIT);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -ENODEV);
  assert_null(g_priv);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_DEINIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_DEINIT), 1);
}

static void init_stream_fail_start(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();

  (void)state;
  mock_yuv_set_ret(MOCK_YUV_FN_YUV_START, BK_ERR_BUSY);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), -EBUSY);
  assert_null(g_priv);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_DEINIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_DEINIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_ENCODE_ENABLE), 0);
}

/* ---------------------------------------------------------------------- */
/* uninitialize                                                           */
/* ---------------------------------------------------------------------- */

static void uninit_flow(void **state)
{
  const struct mock_yuv_call_s *c;
  unsigned int base;

  (void)state;
  assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), 0);
  assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), -ENODEV);
  base = 15;
  c = mock_yuv_call(base + 0);
  assert_int_equal(c->fn, MOCK_YUV_FN_H264_ENCODE_DISABLE);
  c = mock_yuv_call(base + 1);
  assert_int_equal(c->fn, MOCK_YUV_FN_YUV_STOP);
  assert_int_equal(c->a0, H264_MODE);
  c = mock_yuv_call(base + 2);
  assert_int_equal(c->fn, MOCK_YUV_FN_YUV_SOFT_RESET);
  c = mock_yuv_call(base + 3);
  assert_int_equal(c->fn, MOCK_YUV_FN_YUV_UNREGISTER_ISR);
  assert_int_equal(c->a0, YUV_BUF_H264_ERR);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_UNREGISTER_ISR), 2);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_DEINIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_DEINIT), 1);
  c = mock_yuv_call(base + 6);
  assert_int_equal(c->fn, MOCK_YUV_FN_SYS_GROUP2_DISABLE);
  assert_int_equal(c->a0, 1u);
  assert_int_equal(c->a1, H264_IRQ_BIT);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_REGISTER_ISR), 2);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_FREE), 1);
}

static void uninit_rejects_foreign_priv(void **state)
{
  (void)state;
  assert_int_equal(
    bk7258_yuv_h264_uninitialize((struct bk7258_yuv_h264_s *)0x1), -EINVAL);
}

static void encode_not_initialized(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), 0);
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -ENODEV);
}

/* ---------------------------------------------------------------------- */
/* encode: argument validation                                            */
/* ---------------------------------------------------------------------- */

static void encode_arg_validation(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;

  assert_int_equal(
    bk7258_yuv_h264_encode(NULL, &input, &output), -EINVAL);
  assert_int_equal(
    bk7258_yuv_h264_encode(g_priv, NULL, &output), -EINVAL);
  assert_int_equal(
    bk7258_yuv_h264_encode(g_priv, &input, NULL), -EINVAL);
  output.data = NULL;
  assert_int_equal(
    bk7258_yuv_h264_encode(g_priv, &input, &output), -EINVAL);
  output.data = g_out;

