open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_yuv_h264.c
  input.length = FRAME_BYTES - 1;
  assert_int_equal(
    bk7258_yuv_h264_encode(g_priv, &input, &output), -EINVAL);
  input.length = FRAME_BYTES;

  input.data = g_cache;
  assert_int_equal(
    bk7258_yuv_h264_encode(g_priv, &input, &output), -EINVAL);
  input.data = g_input;

  output.data = g_cache;
  assert_int_equal(
    bk7258_yuv_h264_encode(g_priv, &input, &output), -EINVAL);
  output.data = g_out;

  output.data = g_input;
  assert_int_equal(
    bk7258_yuv_h264_encode(g_priv, &input, &output), -EINVAL);
  output.data = g_out;

  input.data = (const uint8_t *)(uintptr_t)0x100000000ULL;
  assert_int_equal(
    bk7258_yuv_h264_encode(g_priv, &input, &output), -EOVERFLOW);
  input.data = g_input;

  output.data = (uint8_t *)(uintptr_t)0x100000000ULL;
  assert_int_equal(
    bk7258_yuv_h264_encode(g_priv, &input, &output), -EOVERFLOW);
  output.data = g_out;

  assert_int_equal(mock_yuv_call_count(), 15);
}

static void encode_timeout_overflow(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_tickwait_hook(hook_fire_final);
  cfg.timeout_ms = UINT32_MAX;
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), 0);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -ERANGE);
}

/* ---------------------------------------------------------------------- */
/* encode: happy path and DMA setup                                       */
/* ---------------------------------------------------------------------- */

static void encode_happy_path(void **state)
{
  struct bk7258_yuv_h264_output_s output;
  const dma_config_t *dc;
  int ret;

  (void)state;
  ret = run_happy_encode(&output);
  assert_int_equal(ret, 0);
  assert_int_equal(output.length, 9216u);
  assert_int_equal(mock_yuv_dest_start(), (uint32_t)(uintptr_t)g_out);
  assert_int_equal(mock_yuv_dest_end(),
                   (uint32_t)(uintptr_t)g_out + CAPACITY);
  assert_int_equal(mock_yuv_transfer_len(), CHUNK);
  assert_int_equal(mock_yuv_src_burst(), BURST_LEN_SINGLE);
  assert_int_equal(mock_yuv_dest_burst(), BURST_LEN_INC16);
  assert_int_equal(mock_yuv_src_sec(), DMA_ATTR_SEC);
  assert_int_equal(mock_yuv_dest_sec(), DMA_ATTR_SEC);

  dc = mock_yuv_dma_config();
  assert_true(mock_yuv_dma_config_valid());
  assert_int_equal(dc->mode, DMA_WORK_MODE_REPEAT);
  assert_int_equal(dc->chan_prio, 0);
  assert_int_equal(dc->src.dev, DMA_DEV_H264);
  assert_int_equal(dc->src.width, DMA_DATA_WIDTH_32BITS);
  assert_int_equal(dc->src.addr_inc_en, DMA_ADDR_INC_ENABLE);
  assert_int_equal(dc->src.addr_loop_en, DMA_ADDR_LOOP_ENABLE);
  assert_int_equal(dc->src.start_addr, 0x00c00000u);
  assert_int_equal(dc->src.end_addr, 0x00c00004u);
  assert_int_equal(dc->dst.dev, DMA_DEV_DTCM);
  assert_int_equal(dc->dst.width, DMA_DATA_WIDTH_32BITS);
  assert_int_equal(dc->dst.addr_inc_en, DMA_ADDR_INC_ENABLE);
  assert_int_equal(dc->dst.addr_loop_en, DMA_ADDR_LOOP_ENABLE);
  assert_int_equal(dc->dst.start_addr, (uint32_t)(uintptr_t)g_out);
  assert_int_equal(dc->dst.end_addr,
                   (uint32_t)(uintptr_t)g_out + CAPACITY);

  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_INIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_SET_DEST_ADDR), 0);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_ENABLE_FINISH), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_RENCODE_START), 4);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_FLUSH_SRC), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_STOP), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_DISABLE_FINISH), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_SOFT_RESET), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_SOFT_RESET), 0);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_GET_COUNT), 1);

  /* The last two blocks were copied into the double-buffer slots. */
  assert_int_equal(g_cache[0], g_input[2 * BLOCK_BYTES]);
  assert_int_equal(g_cache[BLOCK_BYTES], g_input[3 * BLOCK_BYTES]);
  assert_memory_equal(g_cache, g_input + 2 * BLOCK_BYTES, 64);
  assert_memory_equal(g_cache + BLOCK_BYTES, g_input + 3 * BLOCK_BYTES, 64);
}

static void encode_dma_reuse_updates_dest(void **state)
{
  struct bk7258_yuv_h264_output_s output;
  const struct mock_yuv_call_s *c;
  int ret;

  (void)state;
  ret = run_happy_encode(&output);
  assert_int_equal(ret, 0);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_INIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_SET_DEST_ADDR), 0);

  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_tickwait_hook(hook_fire_happy);
  g_hook_guard = 0;
  output.data = g_out2;
  output.capacity = CAPACITY;
  output.length = 0;
  {
    struct bk7258_yuv_h264_input_s input;

    input.data = g_input;
    input.length = FRAME_BYTES;
    ret = bk7258_yuv_h264_encode(g_priv, &input, &output);
  }
  assert_int_equal(ret, 0);
  assert_int_equal(output.length, 9216u);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_INIT), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_SET_DEST_ADDR), 1);
  c = mock_yuv_call(mock_yuv_call_count() - 1);
  assert_int_equal(c->fn, MOCK_YUV_FN_DMA_GET_REMAIN);
  assert_int_equal(mock_yuv_dest_start(), (uint32_t)(uintptr_t)g_out2);
  assert_int_equal(mock_yuv_dest_end(),
                   (uint32_t)(uintptr_t)g_out2 + CAPACITY);
}

static void encode_dma_capacity_reject(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  output.capacity = CHUNK - 1;
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EINVAL);
  output.capacity = CAPACITY;
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EIO);
}

