open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_yuv_h264.c
static void encode_dma_maxlen_reject(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_transfer_len_max(0);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -E2BIG);
  mock_yuv_set_transfer_len_max(CHUNK);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EIO);
}

static void encode_dma_init_fail(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_ret(MOCK_YUV_FN_DMA_INIT, BK_ERR_DMA_TRANS_LEN);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EINVAL);
  assert_true(mock_yuv_dma_config_valid());
  mock_yuv_set_ret(MOCK_YUV_FN_DMA_INIT, BK_OK);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EIO);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_DEINIT), 1);
}

static void encode_dma_setup_step_fail(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;
  int fns[5] =
  {
    MOCK_YUV_FN_DMA_SET_TRANSFER_LEN,
    MOCK_YUV_FN_DMA_SET_SRC_BURST,
    MOCK_YUV_FN_DMA_SET_DEST_BURST,
    MOCK_YUV_FN_DMA_SET_SRC_SEC,
    MOCK_YUV_FN_DMA_SET_DEST_SEC,
  };
  int i;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  for (i = 0; i < 5; i++)
    {
      struct bk7258_yuv_h264_config_s cfg = default_config();

      mock_yuv_sdk_reset();
      assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), 0);
      mock_yuv_set_ret(fns[i], BK_ERR_PARAM);
      assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                       -EINVAL);
      mock_yuv_set_ret(fns[i], BK_OK);
      assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                       -EIO);
      assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), 0);
      g_priv = NULL;
    }
}

static void encode_dma_start_fail(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_ret(MOCK_YUV_FN_DMA_START, BK_ERR_DMA_NOT_INIT);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -ENODEV);
  mock_yuv_set_ret(MOCK_YUV_FN_DMA_START, BK_OK);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EIO);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_FLUSH_SRC), 0);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_STOP), 0);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_DISABLE_FINISH), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_SOFT_RESET), 1);
}

static void encode_rencode_initial_fail(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_ret(MOCK_YUV_FN_YUV_RENCODE_START, BK_ERR_BUSY);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EBUSY);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_STOP), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_SOFT_RESET), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_DEINIT), 0);
}

static void encode_rencode_mid_fail(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_tickwait_hook(hook_mid_rencode_fail);
  g_hook_guard = 0;
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EBUSY);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_SOFT_RESET), 1);
}

/* ---------------------------------------------------------------------- */
/* encode: event flows                                                    */
/* ---------------------------------------------------------------------- */

static void encode_timeout_faults(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_tickwait_hook(hook_noop);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -ETIMEDOUT);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EIO);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_SOFT_RESET), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_DEINIT), 0);
  assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), 0);
}

static void encode_error_event_faults(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_tickwait_hook(hook_error_event);
  g_hook_guard = 0;
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EIO);
  assert_int_equal(output.length, 0);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_SOFT_RESET), 1);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EIO);
}

static void encode_dma_full_maps_to_enospc(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_tickwait_hook(hook_fire_full_then_silence);
  g_hook_guard = 0;
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -ENOSPC);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_STOP), 1);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_H264_SOFT_RESET), 1);
}

static void encode_dma_full_encoded_overflow(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_encode_words(6144u);
  mock_yuv_set_tickwait_hook(hook_fire_full_then_silence);
  g_hook_guard = 0;
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -ENOSPC);
}

static void encode_final_one_chunk_lag_allowed(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;
  int ret;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_tickwait_hook(hook_fire_finish_and_final);
  g_hook_guard = 0;
  ret = bk7258_yuv_h264_encode(g_priv, &input, &output);
  assert_int_equal(ret, 0);
  assert_int_equal(output.length, 9216u);
}

static void encode_final_remain_too_large(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;
  int ret;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(CHUNK + 1);
  mock_yuv_set_tickwait_hook(hook_fire_final);
  g_hook_guard = 0;
  ret = bk7258_yuv_h264_encode(g_priv, &input, &output);
  assert_int_equal(ret, -EIO);
  assert_int_equal(output.length, 0);
  assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), 0);
}

static void encode_final_encoded_zero(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;
  int ret;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_encode_words(0);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_tickwait_hook(hook_fire_final);
  g_hook_guard = 0;
  ret = bk7258_yuv_h264_encode(g_priv, &input, &output);
  assert_int_equal(ret, -EIO);
  assert_int_equal(output.length, 0);
}

static void encode_final_encoded_overflow_capacity(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;
  int ret;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_encode_words(6144u);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_tickwait_hook(hook_fire_final);
  g_hook_guard = 0;
  ret = bk7258_yuv_h264_encode(g_priv, &input, &output);
  assert_int_equal(ret, -ENOSPC);
  assert_int_equal(output.length, 0);
}

static void encode_final_written_overflow(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;
  int ret;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_tickwait_hook(hook_fire_finishes_and_final);
  g_hook_guard = 0;
  ret = bk7258_yuv_h264_encode(g_priv, &input, &output);
  assert_int_equal(ret, -EIO);
  assert_int_equal(output.length, 0);
}

static void encode_final_mismatch_short(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;
  int ret;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(2048u);
  mock_yuv_set_tickwait_hook(hook_fire_final);
  g_hook_guard = 0;
  ret = bk7258_yuv_h264_encode(g_priv, &input, &output);
  assert_int_equal(ret, -EIO);
  assert_int_equal(output.length, 0);
}

static void encode_final_stop_frame_fail_faults(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;
  int ret;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_ret(MOCK_YUV_FN_YUV_SOFT_RESET, BK_ERR_TIMEOUT);
  mock_yuv_set_tickwait_hook(hook_fire_final);
  g_hook_guard = 0;
  ret = bk7258_yuv_h264_encode(g_priv, &input, &output);
  assert_int_equal(ret, -ETIMEDOUT);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EIO);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_YUV_SOFT_RESET), 1);
}

static void encode_final_flush_fail_faults(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;
  int ret;

  (void)state;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_ret(MOCK_YUV_FN_DMA_FLUSH_SRC, BK_ERR_NOT_SUPPORT);
  mock_yuv_set_tickwait_hook(hook_fire_final);
  g_hook_guard = 0;
  ret = bk7258_yuv_h264_encode(g_priv, &input, &output);
  assert_int_equal(ret, -ENOTSUP);
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output),
                   -EIO);
}

static void encode_default_timeout_ok(void **state)
{
  struct bk7258_yuv_h264_config_s cfg = default_config();
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  cfg.timeout_ms = 0;
  assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), 0);
  assert_int_equal(bk7258_yuv_h264_initialize(&g_priv, &cfg), 0);
  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_tickwait_hook(hook_fire_final);
  g_hook_guard = 0;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output), 0);
  assert_int_equal(output.length, 9216u);
}

static void encode_stale_events_ignored(void **state)
{
  struct bk7258_yuv_h264_input_s input;
  struct bk7258_yuv_h264_output_s output;

  (void)state;
  mock_yuv_fire_h264_line();
  mock_yuv_fire_h264_final();
  mock_yuv_fire_h264_line();
  mock_yuv_set_encode_words(2304u);
  mock_yuv_set_remain_len(1024u);
  mock_yuv_set_tickwait_hook(hook_fire_final);
  g_hook_guard = 0;
  input.data = g_input;
  input.length = FRAME_BYTES;
  output.data = g_out;
  output.capacity = CAPACITY;
  output.length = 0;
  assert_int_equal(bk7258_yuv_h264_encode(g_priv, &input, &output), 0);
  assert_int_equal(output.length, 9216u);
}

/* ---------------------------------------------------------------------- */
/* misc                                                                   */
/* ---------------------------------------------------------------------- */

static void encode_happy_then_uninit(void **state)
{
  struct bk7258_yuv_h264_output_s output;
  int ret;

  (void)state;
  ret = run_happy_encode(&output);
  assert_int_equal(ret, 0);
  assert_int_equal(output.length, 9216u);
  assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), 0);
  assert_int_equal(mock_yuv_calls_of(MOCK_YUV_FN_DMA_FLUSH_SRC), 1);
  assert_int_equal(bk7258_yuv_h264_uninitialize(g_priv), -ENODEV);
}

int main(void)
{
  const struct CMUnitTest tests[] =
  {
    /* initialize */
    cmocka_unit_test_setup_teardown(init_geometry_reject, group_setup,
                                    teardown_reset),
    cmocka_unit_test_setup_teardown(init_param_checks, group_setup,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(init_cache_reject, group_setup,
                                    teardown_reset),
    cmocka_unit_test_setup_teardown(init_stream_call_order, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(init_root_fail_rolls_back, group_setup,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(init_dma_alloc_fail, group_setup,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(init_register_isr_fail, group_setup,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(init_stream_fail_yuv_init, group_setup,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(init_stream_fail_h264_init, group_setup,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(init_stream_fail_set_em_base,
                                    group_setup, teardown_reset),
    cmocka_unit_test_setup_teardown(init_stream_fail_route, group_setup,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(init_stream_fail_isr_register,
                                    group_setup, teardown_reset),
    cmocka_unit_test_setup_teardown(init_stream_fail_start, group_setup,
                                    teardown_ok),
    /* uninitialize */
    cmocka_unit_test_setup_teardown(uninit_flow, setup_ok,
                                    teardown_reset),
    cmocka_unit_test_setup_teardown(uninit_rejects_foreign_priv, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_not_initialized, setup_ok,
                                    teardown_ok),
    /* encode: argument validation */
    cmocka_unit_test_setup_teardown(encode_arg_validation, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_timeout_overflow, group_setup,
                                    teardown_ok),
    /* encode: happy path and DMA setup */
    cmocka_unit_test_setup_teardown(encode_happy_path, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_dma_reuse_updates_dest,
                                    setup_ok, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_dma_capacity_reject, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_dma_maxlen_reject, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_dma_init_fail, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_dma_setup_step_fail,
                                    group_setup, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_dma_start_fail, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_rencode_initial_fail, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_rencode_mid_fail, setup_ok,
                                    teardown_ok),
    /* encode: event flows */
    cmocka_unit_test_setup_teardown(encode_timeout_faults, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_error_event_faults, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_dma_full_maps_to_enospc,
                                    setup_ok, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_dma_full_encoded_overflow,
                                    setup_ok, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_final_one_chunk_lag_allowed,
                                    setup_ok, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_final_remain_too_large,
                                    setup_ok, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_final_encoded_zero, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_final_encoded_overflow_capacity,
                                    setup_ok, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_final_written_overflow,
                                    setup_ok, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_final_mismatch_short, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_final_stop_frame_fail_faults,
                                    setup_ok, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_final_flush_fail_faults,
                                    setup_ok, teardown_ok),
    cmocka_unit_test_setup_teardown(encode_default_timeout_ok, setup_ok,
                                    teardown_ok),
    cmocka_unit_test_setup_teardown(encode_stale_events_ignored, setup_ok,
                                    teardown_ok),
    /* misc */
    cmocka_unit_test_setup_teardown(encode_happy_then_uninit, setup_ok,
                                    teardown_ok),
  };

  return cmocka_run_group_tests(tests, NULL, NULL);
}
